# Exercise notebook 2: Cleaning up our act
This Jupyter notebook, for the second part of The Open University's _Learn to code for Data Analysis_ course, has code examples and coding activities for you. Remember to run the code in this notebook before you start.

You'll come across steps in the course directing you to this notebook. Once you've done each exercise, go back to the corresponding step and mark it as complete.

RUTH ALEXANDER: Hello again. In the previous week the data you looked at was quite tidy ready to be analysed. Unfortunately it's often the case that data is published in a form that you can't immediately start to work with. For example, numbers and dates may be in inconsistent formats, textual data may contain spurious characters and there may even be missing or nonsensical data, for example due to a typo. Such data is often referred to as 'dirty data' and it needs to be put through a process known unsurprisingly as data cleaning or data cleansing before it can be analysed. Data cleaning is often a substantial but unglamorous part of data analysis.

Cleaning up our act
Data is very often published in a form that you can’t immediately start to work with.

Dirty data needs to be put through a process known as **data cleaning** or **data cleansing**, before it can be analysed. Data cleaning is often a substantial, but unglamorous, part of data analysis.

The dataset we’ll use to do this has come from the Weather Underground, which creates weather forecasts from data sent to them by a worldwide network of over 100,000 weather enthusiasts who have personal weather stations on their house or in their garden.

In addition to creating weather forecasts from that data, the Weather Underground also keeps that data as historic weather records allowing members of the public to download weather datasets for a particular time period and location.

**Datasets are rarely ‘clean’ and fit for purpose, so it will be necessary to clean up the data and ‘mould it’ for your purposes**. You will then learn how to visualise data by creating graphs using the plot() function.

# Getting and displaying dataframe columns

You learned in Week 1 that you can get and display a single column of a dataframe by putting the name of the column (in quotes) within square brackets immediately after the dataframe’s name.

df['TB deaths']

0    13000.00
1       20.00
2     5100.00
3        0.26
4     6900.00
5        1.20
6      570.00

Notice that although there is an index, there is no column heading. This is because what is returned is not a new dataframe with a single column but an example of the **Series** data type.

# In fact each column in a dataframe is an example of a series.

The Series data type is a collection of values with an integer index that starts from zero. In addition, the Series data type has many of the same methods as the DataFrame data type, so you can still execute code like

# What is a CSV file?
A CSV file is a plain text file that is used to hold tabular data. The acronym CSV is short for ‘comma-separated values’.

Note that each value or column name is separated by a comma **but actually any character can be used to separate values in a CSV file, including spaces and tabs etc., hence CSV can also stand for ‘character-separated values’.***

Because CSV files are in plain-text it makes the data easy to import into any spreadsheet program, database or pandas dataframe.

In [40]:
import warnings
warnings.simplefilter('ignore', FutureWarning)

from pandas import *

## Exercise 1: Dataframes and CSV files

To read a CSV file into a dataframe you need to call the pandas function called <code>read_csv()</code>. The simplest usage of this function is with a single argument, a string that holds the name of the CSV file, for example.

In [41]:
df = read_csv('WHO POP TB all.csv')

The above code creates a dataframe from the data in the file WHO POP TB all.csv and assigns it to the variable df. This is the simplest usage of the read_csv() function, just using a single argument, a string that holds the name of the CSV file.

However the function can take many additional arguments (some of which you’ll use later), which determine how the file is to be read.

# Dataframes and the 'dot' notation

Dataframes have methods that can be accessed using the following format
dataframeName.methodName() This is called the **dot notation.**
Methods are like functions that only work in the context of the dataframe.

### Dataframe attributes

A dataframe attribute is like a variable that can only be accessed in the context of a dataframe. One such attribute is <code>columns</code> which holds a dataframe's column names.

In [42]:
df.columns

Index(['Country', 'Population (1000s)', 'TB deaths'], dtype='object')

### Dataframe rows
A dataframe has a default integer index for its rows, which starts at zero <code>0</code>. The `iloc` attribute can be used to obtain the row at the given index.

In [43]:
df.iloc[0] # first row, index 0

Country               Afghanistan
Population (1000s)          30552
TB deaths                   13000
Name: 0, dtype: object

In [44]:
df.iloc[2] # third row, index 2

Country               Algeria
Population (1000s)      39208
TB deaths                5100
Name: 2, dtype: object

### The <code>head()</code> method

The `head()` method returns a dataframe with the first rows, as many as given in the argument. By default, if the argument is missing, it returns the first five rows.

In [45]:
df.head() # first five rows

       Country  Population (1000s)  TB deaths
0  Afghanistan               30552   13000.00
1      Albania                3173      20.00
2      Algeria               39208    5100.00
3      Andorra                  79       0.26
4       Angola               21472    6900.00

In [46]:
df.head(7) # first seven rows

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00

### The <code>tail()</code> method
The <code>tail()</code> method is similar to the <code>head()</code> method. If no argument is used, the last five rows of the dataframe are returned, otherwise the number of rows returned is dependent on the argument.

In [47]:
df.tail() # last five rows

                                Country  Population (1000s)  TB deaths
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

### Selecting and displaying columns in a dataframe
You found in Week 1 that you can select and display the values for a single dataframe column by puting the name of the column (in quotes) within square brackets immediately after the dataframe's name. However you can also select and display the values for multiple columns too.

To get multiple columns you need to use a list. A list in Python is a number of items separated by commas within square brackets, for example `['Country', 'Population (1000s)']`. This list is then put within square brackets immediately after the dataframe's name. The resulting expression represents a new dataframe, just with those columns, and therefore any dataframe method can be applied to it, like for example `head()`:

In [48]:
df[['Country', 'Population (1000s)']].head()

       Country  Population (1000s)
0  Afghanistan               30552
1      Albania                3173
2      Algeria               39208
3      Andorra                  79
4       Angola               21472

### Applying methods to a dataframe column
The `iloc` attribute and the <code>head()</code> and <code>tail()</code> methods discussed above can be used with single columns.

In [49]:
df['TB deaths'].iloc[2] # third value of deaths column

5100.0

In [50]:
df['Population (1000s)'].tail() # last five values of population column

189    30405
190    91680
191    24407
192    14539
193    14150
Name: Population (1000s), dtype: int64

### Tasks

In the code cell below, write the code to get and display the 55th row in the dataframe <code>df</code>.

In [53]:
df.iloc[54]

Country               El Salvador
Population (1000s)           6340
TB deaths                      61
Name: 54, dtype: object

In the code cell below write the code to display the first 10 rows of the dataframe <code>df</code>.

In [54]:
df.head(10)

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00
7              Armenia                2977     170.00
8            Australia               23343      45.00
9              Austria                8495      29.00

In the code cell below, select and display the first eight rows from the <code>'Country'</code> and <code>'TB deaths'</code> columns.

In [55]:
df[['Country','TB deaths']].head(8)

               Country  TB deaths
0          Afghanistan   13000.00
1              Albania      20.00
2              Algeria    5100.00
3              Andorra       0.26
4               Angola    6900.00
5  Antigua and Barbuda       1.20
6            Argentina     570.00
7              Armenia     170.00

**Now go back to the course step and mark it complete.**

## Exercise 2: Comparison operators
Python has the following comparison operators:

    == (equals)
    != (not equal)
    < (less than)
    > (greater than)
    <= (less than or equal to)
    >= (greater than or equal to)

The following code will get and display all the rows in `df` where it is `True` that the value in the `'Population (1000s)'` column is greater than `80000`.

In [ ]:
df[df['Population (1000s)'] > 80000]

### Task
In the code cell below write code to find all the rows in <code>df</code> where TB deaths exceed 10000.

**Now go back to the course step and mark it complete.**

## Exercise 3: Bitwise operators

Pandas has two operators to make more complicated queries. Use the operator `&` (means 'and') to select rows where two conditions are both true. Use the operator `|` (means 'or') to select rows where at least one condition is true. Don't forget to put parentheses around _each_ comparison. For example, the following expression selects only countries with a population over 80 million inhabitants **and** with more that 10 thousand deaths.

In [ ]:
df[(df['Population (1000s)'] > 80000) & (df['TB deaths'] > 10000)]

If the same columns will be used repeatedly in the program, the code becomes more readable if written as follows:

In [ ]:
population = df['Population (1000s)']
deaths = df['TB deaths']
df[(population > 80000) & (deaths > 10000)]

### Task
In the code cell below find  all the countries where the Population (1000s) is **less than or equal to** 50000 **or** TB deaths are **greater than or equal to** 20000.

**Now go back to the course step and mark it complete.**

## Exercise 4: Display rows from dataframe

You have downloaded the file London_2014.csv from our website, it can now be read into a dataframe.

In [ ]:
london = read_csv('London_2014.csv')
london.head()

### Removing initial spaces

There are too many columns for the dataframe to fit horizontally in this notebook, but they can be displayed separately.

In [ ]:
london.columns

This shows that <code>' Max Wind SpeedKm/h'</code> is prefixed by a space, as are other columm names such as <code>' Mean Humidity'</code> and <code>' Max Sea Level PressurehPa'</code>.

The  <code>read_csv()</code> function has interpreted spaces after commas as being part of the next value. This can be rectified  easily by adding another argument to the <code>read_csv()</code> function to skip the initial spaces after a comma.

In [ ]:
london = read_csv('London_2014.csv', skipinitialspace=True)

### Removing extra characters

Another problem shown above is that the final column is called <code>'WindDirDegrees&lt; br /&gt;'</code>.

When the dataset was exported from the Weather Underground web site html line breaks were automatically added to each line in the file which <code>read_csv()</code> has interpreted as part of the column name and its values. This can be seen more clearly by looking at more values in the final column:

In [ ]:
london['WindDirDegrees<br />'].head()

<code>'WindDirDegrees&lt; br /&gt;'</code> can be changed to <code>'WindDirDegrees'</code> with the <code>rename()</code> method as follows:

In [ ]:
london = london.rename(columns={'WindDirDegrees<br />' : 'WindDirDegrees'})

To remove the <code>'&lt; br /&gt;'</code> html line breaks from the values in the <code>'WindDirDegrees'</code> column you need to use the string method <code>rstrip()</code> which is used to remove characters from the *end* or 'rear' of a string:

In [ ]:
london['WindDirDegrees'] = london['WindDirDegrees'].str.rstrip('<br />')

Display the first few rows of the <code>'WindDirDegrees'</code> to confirm the change:

In [ ]:
london['WindDirDegrees'].head()

### Missing values

Missing (also called null or not available) values are marked as NaN (not a number) in dataframes.

In [ ]:
london['Events'].tail()

The `isnull()` method returns `True` for each row in a column that has a null value. The method can be used to select and display those rows. Scroll the table below to the right to check that the events column is only showing missing values.

In [ ]:
london[london['Events'].isnull()]

One way to deal with missing values is to replace them by some value. The column method `fillna()` fills all not available value cells with the value given as argument. In the example below, each missing event is replaced by the empty string.

In [ ]:
london['Events'] = london['Events'].fillna('')
london[london['Events'].isnull()]

The empty dataframe (no rows) confirms there are no more missing event values.

Another way to deal with missing values is to ignore rows with them. The `dropna()` dataframe method returns a new dataframe where all rows with at least one non-available value have been removed.

In [ ]:
london.dropna()

Note that the table above has fewer than 251 of the original 365 rows, so there must be further null values besides the 114 missing events.

### Changing the value type of a column

The type of every column in a dataframe can be determined by looking at the dataframe's `dtypes` attribute, like this:

In [ ]:
london.dtypes

The type of all the values in a column can be changed using the <code>astype()</code> method. The following code will change the values in the <code>'WindDirDegrees'</code> column from strings (`object`) to integers (<code>int64</code>).

In [ ]:
london['WindDirDegrees'] = london['WindDirDegrees'].astype('int64')

The function `to_datetime()` is needed to change the values in the `'GMT'` column from strings (`object`) to dates (`datetime64`):

In [ ]:
london['GMT'] = to_datetime(london['GMT'])
london.dtypes

Values of type `datetime64` can be created using the `datetime()` function where the first integer argument is the year, the second the month and the third the day. 
The code below will get and display the row in the dataframe whose `'GMT'` value is 4th June 2014.

In [ ]:
london[london['GMT'] == datetime(2014, 6, 4)]

Queries such as 'Return all the rows where the date is between 8 December and 12 December' can be made:

In [ ]:
dates = london['GMT']
start = datetime(2014, 12, 8)
end = datetime(2014, 12, 12)
london[(dates >= start) & (dates <= end)]

### Tasks

Now that the wind direction is given by a number, write code to select all days that had a northerly wind. Hint: select the rows where the direction is greater than or equal to 350 **or** smaller than or equal to 10, as the compass rose shows.

In the code cell below, write code to get and display all the rows in the dataframe that are beween 1 April 2014 and 
11 April 2014.

In the cell below, write two lines of code to display the first five rows that have a missing value in the `'Max Gust SpeedKm/h'` column. Hint: first select the missing value rows and store them in a new dataframe, then display the first five rows of the new dataframe.

**Now go back to the course step and mark it complete.**

## Exercise 5: Every picture tells a story

The following line of code tells Jupyter to display inside this notebook any graph that is created.

In [ ]:
%matplotlib inline

The `plot()` method can make a graph of the values in a column. Gridlines are turned on by the `grid` argument.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True)

The graph can be made bigger by giving the method a `figsize=(x,y)` argument where `x` and `y` are integers that determine the length of the x-axis and y-axis.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Multiple lines can be plotted by selecting multiple columns.

In [ ]:
london[['Max Wind SpeedKm/h', 'Mean Wind SpeedKm/h']].plot(grid=True, figsize=(10,5))

### Task

In the cell below, write code to plot the minimum, mean, and maximum temperature during 2014 in London.

**Now go back to the course step and mark it complete.**

## Exercise 6: Changing a dataframe's index
Changing the dataframe's index from the default to `datetime64` values is done by assigning to the dataframe's `index` attribute the contents of the `'GMT`' column, like this:

In [ ]:
london.index = london['GMT']
london.head(2)

The `iloc` attribute can still be used to get and display rows by number, but now you can now also use the `datetime64` index to get a row by date, using the dataframe's `loc` attribute, like this:

In [ ]:
london.loc[datetime(2014, 1, 1)]

A query such as *'Return all the rows where the date is between December 8th and December 12th'* can now be done  succinctly like this:

In [ ]:
london.loc[datetime(2014,12,8) : datetime(2014,12,12)]

#The meaning of the above code is get the rows beween and including 
#the indices datetime(2014,12,8) and datetime(2014,12,12)

Now we have a `datetime64` index, let's plot `'Max Wind SpeedKm/h'` again:

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Now it is much clearer that the worst winds were in mid February.

### Task
Use the code cell below to plot the values of `'Mean Humidity'` during spring (full months of March, April and May).

**Now go back to the course step and mark it complete.**